Alie20/Embedded_systems/MCU_1/stm32f3xx_drivers/drivers/Src/stm32f303re_USART_driver.c
/*
 * stm32f303re_USART_driver.c
 *
 *  Created on: Oct 5, 2022
 *      Author: alie
 */


#include <stm32f303re_USART_driver.h>
#include <stddef.h>
extern void initialise_monitor_handles(void);

/*********************************************************************
 * @fn      		  - USART_SetBaudRate
 *
 * @brief             -
 *
 * @param[in]         -
 * @param[in]         -
 * @param[in]         -
 *
 * @return            -
 *
 * @Note              -  Resolve all the TODOs

 */
void USART_SetBaudRate(USART_RegDef_t *pUSARTx, uint32_t BaudRate)
{

	//Variable to hold the APB clock
	initialise_monitor_handles();

	uint32_t PCLKx;

	uint32_t usartdiv;


  uint32_t tempreg=0;

  //Get the value of APB bus clock in to the variable PCLKx
  if(pUSARTx == USART1)
  {
	   //USART1 and USART6 are hanging on APB2 bus
	   PCLKx = RCC_GetPCLK2Value();
  }else
  {
	   PCLKx = RCC_GetPCLK1Value();
  }

  //Check for OVER8 configuration bit
  if(pUSARTx->USART_CR1 & (1 << USART_CR1_OVER8))
  {
	   //OVER8 = 1 , over sampling by 8
	   usartdiv = ((2 * PCLKx) / (BaudRate));

       tempreg = (uint16_t)(usartdiv & 0xFFF0);                    // BRR[15:4] = USARTDIV[15:4]
       tempreg |= (uint16_t)((usartdiv & (uint16_t)0x000F) >> 1);  // BRR[2:0]  = USARTDIV[3:0] shifted 1 bit to the right.




  }else
  {
	   //over sampling by 16
	  usartdiv = (PCLKx) / (BaudRate);
	  tempreg = usartdiv;

  }
  printf("Baud Rate %ld \n",tempreg);


  //copy the value of tempreg in to BRR register

  pUSARTx->USART_BRR = tempreg;

}
void USART_Init(USART_Handle_t *pUSARTHandle)
{

	//Temporary variable
	uint32_t tempreg=0;

	USART_PeripheralControl(pUSARTHandle->pUSARTx, Enable);

/******************************** Configuration of CR1******************************************/


	//Enable USART Tx and Rx engines according to the USART_Mode configuration item
	if ( pUSARTHandle->USART_Config.USART_Mode == USART_MODE_ONLY_RX)
	{
		//Implement the code to enable the Receiver bit field
		tempreg|= (1 << USART_CR1_RE);
	}else if (pUSARTHandle->USART_Config.USART_Mode == USART_MODE_ONLY_TX)
	{
		//Implement the code to enable the Transmitter bit field
		tempreg |= ( 1 << USART_CR1_TE );

	}else if (pUSARTHandle->USART_Config.USART_Mode == USART_MODE_TXRX)
	{
		//Implement the code to enable the both Transmitter and Receiver bit fields
		tempreg |= ( ( 1 << USART_CR1_RE) | ( 1 << USART_CR1_TE) );
	}

    //Implement the code to configure the Word length configuration item
	//tempreg |= pUSARTHandle->USART_Config.USART_WordLength << TODO ;
	if (pUSARTHandle->USART_Config.USART_WordLength == USART_WORDLEN_8BITS)
	{
		tempreg &= ~( 1 << USART_CR1_MO);
		tempreg &= ~(1<< USART_CR1_M1);
	}
	else if (pUSARTHandle->USART_Config.USART_WordLength == USART_WORDLEN_9BITS)
	{
		tempreg |= ( 1 << USART_CR1_MO);
		tempreg &= ~(1<< USART_CR1_M1);
	}
	else if (pUSARTHandle->USART_Config.USART_WordLength == USART_WORDLEN_7BITS)
	{
		tempreg &= ~( 1 << USART_CR1_MO);
		tempreg |= (1<< USART_CR1_M1);

	}

    //Configuration of parity control bit fields
	if ( pUSARTHandle->USART_Config.USART_ParityControl == USART_PARITY_EN_EVEN)
	{
		//Implement the code to enable the parity control
		tempreg |= ( 1 << USART_CR1_PCE);

		//Implement the code to enable EVEN parity
		//Not required because by default EVEN parity will be selected once you enable the parity control

	}else if (pUSARTHandle->USART_Config.USART_ParityControl == USART_PARITY_EN_ODD )
	{
		//Implement the code to enable the parity control
	    tempreg |= ( 1 << USART_CR1_PCE);

	    //Implement the code to enable ODD parity
	    tempreg |= ( 1 << USART_CR1_PS);

	}

   //Program the CR1 register
	pUSARTHandle->pUSARTx->USART_CR1 = tempreg;

/******************************** Configuration of CR2******************************************/

	tempreg = 0;

	tempreg |= pUSARTHandle->USART_Config.USART_NoOfStopBits << USART_CR2_STOP;

	pUSARTHandle->pUSARTx->USART_CR2 = tempreg;


	//pUSARTHandle->pUSARTx->USART_CR2 |= (pUSARTHandle->USART_Config.USART_NoOfStopBits << USART_CR2_STOP);

	//Implement the code to configure the number of stop bits inserted during USART frame transmission
	//tempreg=0;
	if (pUSARTHandle->USART_Config.USART_NoOfStopBits == USART_STOPBITS_1)
	{
		pUSARTHandle->pUSARTx->USART_CR2 |= (0 << USART_CR2_STOP);
	}
	else if (pUSARTHandle->USART_Config.USART_NoOfStopBits == USART_STOPBITS_0_5)
	{
		pUSARTHandle->pUSARTx->USART_CR2 |= (1 << USART_CR2_STOP);
	}
	else if (pUSARTHandle->USART_Config.USART_NoOfStopBits == USART_STOPBITS_2)
	{
		pUSARTHandle->pUSARTx->USART_CR2 |= (2 << USART_CR2_STOP);
	}
	else if (pUSARTHandle->USART_Config.USART_NoOfStopBits == USART_STOPBITS_1_5)
	{
		pUSARTHandle->pUSARTx->USART_CR2 |= (3 << USART_CR2_STOP);
	}
	//tempreg |= pUSARTHandle->USART_Config.USART_NoOfStopBits << USART_CR2_STOP;

/******************************** Configuration of CR3******************************************/

	tempreg=0;

	//Configuration of USART hardware flow control
	if ( pUSARTHandle->USART_Config.USART_HwFlowControl == USART_HW_FLOW_CTRL_CTS)
	{
		//Implement the code to enable CTS flow control
		tempreg |= ( 1 << USART_CR3_CTSE);


	}else if (pUSARTHandle->USART_Config.USART_HwFlowControl == USART_HW_FLOW_CTRL_RTS)
	{
		//Implement the code to enable RTS flow control
		tempreg |= (1 << USART_CR3_RTSE);

	}else if (pUSARTHandle->USART_Config.USART_HwFlowControl == USART_HW_FLOW_CTRL_CTS_RTS)
	{
		//Implement the code to enable both CTS and RTS Flow control
		tempreg |= (1<< USART_CR3_CTSE) | (1<<USART_CR3_RTSE);
	}


	pUSARTHandle->pUSARTx->USART_CR3 = tempreg;

/******************************** Configuration of BRR(Baudrate register)******************************************/

	//Implement the code to configure the baud rate

	USART_SetBaudRate(pUSARTHandle->pUSARTx,pUSARTHandle->USART_Config.USART_Baud);

	//Implement the code to enable the peripheral for given USART peripheral
	USART_PeripheralControl(pUSARTHandle->pUSARTx, Enable);






}
/*
 * De-Init
 */
void USART_DeInit(USART_RegDef_t *pUSARTx)
{
	if (pUSARTx == USART1)
	{
		USART1_REG_RESET();
	}
	else if (pUSARTx == USART2)
	{
		USART2_REG_RESET();
	}
	else if (pUSARTx == USART3)
	{
		USART3_REG_RESET();
	}
	else if (pUSARTx == UART4)
	{
		UART4_REG_RESET();
	}
	else if (pUSARTx == UART5)
	{
		UART5_REG_RESET();
	}

